app/Models/RegisterModel.php

    public function validatelogin($data) {

        $email = $data['email'];
        $password = $data['password'];

        $db = \Config\Database::connect();
        $builder = $db->table('user_details');

        $builder->select('user_id,name,email');
        //        $builder->from('user_details');
        $builder->where('email', $email);
        $builder->where('password', $password);
        $query = $builder->get();
---
SELECT `user_id`, `name`, `email`
FROM `user_details`
WHERE `email` = 'breinard@samuel@gmail.com'
AND `password` = 'Abc123!@#'